whywilson/Adafruit_nRF52_Bootloader_OTAFIX/src/boards/boards.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 Ha Thach for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "app_error.h"
#include "nrf_gpio.h"
#include "boards.h"

#ifdef BOARD_HAS_SSD1306
#include "ssd1306_drv.h"
#endif

// Forward declaration  
extern bool is_ota(void);

#include "nrf_pwm.h"
#include "app_scheduler.h"
#include "app_timer.h"
#include "dfu.h"  // Include DFU header for progress tracking

#ifdef LED_APA102_CLK
#include "nrf_spim.h"
#endif

#define SCHED_MAX_EVENT_DATA_SIZE           sizeof(app_timer_event_t)        /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                    30                               /**< Maximum number of events in the scheduler queue. */

#if defined(LED_NEOPIXEL) || defined(LED_RGB_RED_PIN) || defined(LED_APA102_CLK)
void neopixel_init(void);
void neopixel_write(uint8_t* pixels);
void neopixel_teardown(void);
#endif

//--------------------------------------------------------------------+
// IMPLEMENTATION
//--------------------------------------------------------------------+

static uint32_t _systick_count = 0;

#ifdef BOARD_HAS_SSD1306
// Ultra-minimal DFU status tracking for SSD1306 display
static bool dfu_active = false;
static uint8_t last_shown_progress = 0;
static bool dfu_header_shown = false;  // Track if header is already displayed
static bool dfu_completed = false;     // Track if DFU has completed successfully
#endif

void SysTick_Handler(void) {
  _systick_count++;
  led_tick();
  
#ifdef BOARD_HAS_SSD1306
  // Check progress every 1000ms for higher precision, display every 1%
  if (dfu_active && (_systick_count % 1000) == 0 && ssd1306_is_enabled()) {
    uint8_t progress = dfu_get_progress_percentage();
    
    // Only show header and switch to progress mode when actual progress starts (>0%)
    if (progress > 0 && !dfu_header_shown) {
      ssd1306_clear();
      ssd1306_draw_string_centered(20, "BLE DFU");
      dfu_header_shown = true;
    }
    
    // Update progress if it changed by at least 1% and progress has started
    if (progress > 0 && progress != last_shown_progress) {
      char progress_str[8];  // Small buffer for progress string
      
      // Use simple integer to string conversion to save flash
      if (progress >= 100) {
        progress_str[0] = '1'; progress_str[1] = '0'; progress_str[2] = '0'; progress_str[3] = '%'; progress_str[4] = '\0';
        // Mark DFU as completed when we reach 100% to prevent "Waiting" on BLE disconnect
        dfu_completed = true;
      } else if (progress >= 10) {
        progress_str[0] = '0' + (progress / 10);
        progress_str[1] = '0' + (progress % 10);
        progress_str[2] = '%';
        progress_str[3] = '\0';
      } else {
        progress_str[0] = '0' + progress;
        progress_str[1] = '%';
        progress_str[2] = '\0';
      }
      
      // Calculate overall centered position for progress bar and text
      int bar_w = 60;
      int bar_h = 6;
      int text_w = 24; // Width for "100%"
      int gap = 4; // Gap between bar and text
      int total_w = bar_w + gap + text_w;
      int start_x = (128 - total_w) / 2;
      int bar_x = start_x;
      int bar_y = 36;
      int text_x = bar_x + bar_w + gap;
      
      // Clear the entire progress area first
      ssd1306_draw_rect(0, bar_y - 2, 128, bar_h + 4, false);
      
      // Draw progress bar border (outline only)
      // Top and bottom lines
      for (int x = 0; x < bar_w; x++) {
        ssd1306_set_pixel(bar_x + x, bar_y, true);         // Top line
        ssd1306_set_pixel(bar_x + x, bar_y + bar_h - 1, true); // Bottom line
      }
      // Left and right lines
      for (int y = 0; y < bar_h; y++) {
        ssd1306_set_pixel(bar_x, bar_y + y, true);             // Left line
        ssd1306_set_pixel(bar_x + bar_w - 1, bar_y + y, true); // Right line
      }
      
      // Fill progress bar
      int fill_w = (progress * (bar_w - 2)) / 100; // -2 for border
      if (fill_w > 0) {
        ssd1306_draw_rect(bar_x + 1, bar_y + 1, fill_w, bar_h - 2, true);
      }
      
      // Draw percentage text
      ssd1306_draw_string(text_x, bar_y - 1, progress_str);

      ssd1306_display();
      
      last_shown_progress = progress;
    }
  }
#endif
}

void button_init(uint32_t pin) {
  if (BUTTON_PULL == NRF_GPIO_PIN_PULLDOWN) {
    nrf_gpio_cfg_sense_input(pin, BUTTON_PULL, NRF_GPIO_PIN_SENSE_HIGH);
  } else {
    nrf_gpio_cfg_sense_input(pin, BUTTON_PULL, NRF_GPIO_PIN_SENSE_LOW);
  }
}

bool button_pressed(uint32_t pin) {
  uint32_t const active_state = (BUTTON_PULL == NRF_GPIO_PIN_PULLDOWN ? 1 : 0);
  return nrf_gpio_pin_read(pin) == active_state;
}

// This is declared so that a board specific init can be called from here.
void __attribute__((weak)) board_init2(void) {}

void board_init(void) {
  // stop LF clock just in case we jump from application without reset
  NRF_CLOCK->TASKS_LFCLKSTOP = 1UL;

  // Use Internal OSC to compatible with all boards
  NRF_CLOCK->LFCLKSRC = CLOCK_LFCLKSRC_SRC_RC;
  NRF_CLOCK->TASKS_LFCLKSTART = 1UL;

  button_init(BUTTON_DFU);
  button_init(BUTTON_FRESET);
  NRFX_DELAY_US(100); // wait for the pin state is stable

#if LEDS_NUMBER > 0
  // use PMW0 for LED RED
  led_pwm_init(LED_PRIMARY, LED_PRIMARY_PIN);
  #if LEDS_NUMBER > 1
  led_pwm_init(LED_SECONDARY, LED_SECONDARY_PIN);
  #endif
#endif

#if defined(LED_NEOPIXEL) || defined(LED_RGB_RED_PIN) || defined(LED_APA102_CLK)
  // use neopixel for use enumeration
  #ifdef NEOPIXEL_POWER_PIN
  nrf_gpio_cfg_output(NEOPIXEL_POWER_PIN);
  nrf_gpio_pin_write(NEOPIXEL_POWER_PIN, 1);
  #endif

  neopixel_init();
#endif

#if ENABLE_DCDC_0 == 1
  NRF_POWER->DCDCEN0 = 1;
#endif
#if ENABLE_DCDC_1 == 1
  NRF_POWER->DCDCEN = 1;
#endif

  // Make sure any custom inits are performed
  board_init2();

