whywilson/Adafruit_nRF52_Bootloader_OTAFIX/src/boards/boards.c
  pwm->MODE = 0;
  pwm->COUNTERTOP = 0x3FF;
  pwm->PRESCALER = 0;
  pwm->DECODER = 0;
  pwm->LOOP = 0;
  pwm->SEQ[0].PTR = 0;
  pwm->SEQ[0].CNT = 0;
}

static uint16_t led_duty_cycles[PWM0_CH_NUM] = {0};

#if LEDS_NUMBER > PWM0_CH_NUM
#error "Only " PWM0_CH_NUM " concurrent status LEDs are supported."
#endif

void led_pwm_init(uint32_t led_index, uint32_t led_pin) {
  NRF_PWM_Type* pwm = NRF_PWM0;

  pwm->ENABLE = 0;

  nrf_gpio_cfg_output(led_pin);
  nrf_gpio_pin_write(led_pin, 1 - LED_STATE_ON);

  pwm->PSEL.OUT[led_index] = led_pin;

  pwm->MODE = PWM_MODE_UPDOWN_Up;
  pwm->COUNTERTOP = 0xff;
  pwm->PRESCALER = PWM_PRESCALER_PRESCALER_DIV_16;
  pwm->DECODER = PWM_DECODER_LOAD_Individual;
  pwm->LOOP = 0;

  pwm->SEQ[0].PTR = (uint32_t) (led_duty_cycles);
  pwm->SEQ[0].CNT = 4; // default mode is Individual --> count must be 4
  pwm->SEQ[0].REFRESH = 0;
  pwm->SEQ[0].ENDDELAY = 0;

  pwm->ENABLE = 1;

  pwm->EVENTS_SEQEND[0] = 0;
//  pwm->TASKS_SEQSTART[0] = 1;
}

void led_pwm_teardown(void) {
  pwm_teardown(NRF_PWM0);
}

void led_pwm_duty_cycle(uint32_t led_index, uint16_t duty_cycle) {
  led_duty_cycles[led_index] = duty_cycle;
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_task_trigger(NRF_PWM0, NRF_PWM_TASK_SEQSTART0);
}

static uint32_t primary_cycle_length;
#ifdef LED_SECONDARY_PIN
static uint32_t secondary_cycle_length;
#endif

void led_tick(void) {
  uint32_t millis = _systick_count;

  uint32_t cycle = millis % primary_cycle_length;
  uint32_t half_cycle = primary_cycle_length / 2;
  if (cycle > half_cycle) {
    cycle = primary_cycle_length - cycle;
  }
  uint16_t duty_cycle = 0x4f * cycle / half_cycle;
  #if LED_STATE_ON == 1
  duty_cycle = 0xff - duty_cycle;
  #endif
  led_pwm_duty_cycle(LED_PRIMARY, duty_cycle);

  #ifdef LED_SECONDARY_PIN
  cycle = millis % secondary_cycle_length;
  half_cycle = secondary_cycle_length / 2;
  if (cycle > half_cycle) {
      cycle = secondary_cycle_length - cycle;
  }
  duty_cycle = 0x8f * cycle / half_cycle;
  #if LED_STATE_ON == 1
  duty_cycle = 0xff - duty_cycle;
  #endif
  led_pwm_duty_cycle(LED_SECONDARY, duty_cycle);
  #endif
}

static uint32_t rgb_color;
static bool temp_color_active = false;
static uint32_t last_display_state = 0xFFFFFFFF;

void led_state(uint32_t state) {
  uint32_t new_rgb_color = rgb_color;
  uint32_t temp_color = 0;
  
  // 只有状态改变时才更新显示内容
  bool display_changed = (last_display_state != state);
  
  switch (state) {
    case STATE_USB_MOUNTED:
      new_rgb_color = 0x00ff00;
      primary_cycle_length = 3000;
      // Display bootloader screen for USB mode
#ifdef BOARD_HAS_SSD1306
      if (ssd1306_is_enabled() && display_changed) {
        ssd1306_clear();
        ssd1306_draw_string_centered(20, "USB Mode");
        ssd1306_draw_string_centered(36, "Bootloader");
        ssd1306_display();
      }
#endif
      break;

    case STATE_BOOTLOADER_STARTED:
    case STATE_USB_UNMOUNTED:
      new_rgb_color = 0xff0000;
      primary_cycle_length = 300;
      break;

    case STATE_WRITING_STARTED:
      temp_color = 0xff0000;
      primary_cycle_length = 100;
      if (is_ota()) {
#ifdef BOARD_HAS_SSD1306
        // Start DFU progress tracking when transfer begins
        if (ssd1306_is_enabled() && display_changed && !dfu_active) {
          dfu_active = true;
          dfu_completed = false;  // Reset completion status for new DFU session
          dfu_header_shown = false;  // Reset header flag for new DFU session
          last_shown_progress = 0;   // Reset progress tracking
          // Show initial waiting state immediately
          ssd1306_clear();
          ssd1306_draw_string_centered(20, "BLE DFU");
          ssd1306_draw_string_centered(36, "Initializing");
          ssd1306_display();
        }
#endif
      } 
      break;

    case STATE_WRITING_FINISHED:
      // Empty means to unset any temp colors.
      primary_cycle_length = 3000;
#ifdef BOARD_HAS_SSD1306
      if (dfu_active) {
        // Final completion display
        if (ssd1306_is_enabled()) {
          ssd1306_clear();
          ssd1306_draw_string_centered(20, "BLE DFU");
          ssd1306_draw_string_centered(36, "Done");
          ssd1306_display();
        }
        dfu_completed = true;   // Mark DFU as completed
        dfu_active = false;
        dfu_header_shown = false;  // Reset for next session
        last_shown_progress = 0;
      }
#endif
      break;

    case STATE_BLE_CONNECTED:
      new_rgb_color = 0x0000ff;
      #ifdef LED_SECONDARY_PIN
      secondary_cycle_length = 3000;
      #else
      primary_cycle_length = 3000;
      #endif
#ifdef BOARD_HAS_SSD1306
      if (ssd1306_is_enabled() && display_changed) {
        dfu_completed = false;  // Reset completion status for new connection
        ssd1306_clear();
        ssd1306_draw_string_centered(20, "BLE DFU");
        ssd1306_draw_string_centered(36, "Connected");
        ssd1306_display();
      }
#endif
      break;

    case STATE_BLE_DISCONNECTED:
      new_rgb_color = 0xff00ff;
      #ifdef LED_SECONDARY_PIN
      secondary_cycle_length = 300;
      #else
      primary_cycle_length = 300;
      #endif
#ifdef BOARD_HAS_SSD1306
      // Only show "Waiting" if DFU hasn't completed yet
      if (ssd1306_is_enabled() && display_changed && !dfu_completed) {
        ssd1306_clear();
        ssd1306_draw_string_centered(20, "BLE DFU");
        ssd1306_draw_string_centered(36, "Waiting");
        ssd1306_display();
      }
#endif
      break;

    default:
      break;
  }
  
  // Update the last display state
  last_display_state = state;
  
  uint8_t* final_color = NULL;
  new_rgb_color &= BOARD_RGB_BRIGHTNESS;
  if (temp_color != 0) {
    temp_color &= BOARD_RGB_BRIGHTNESS;
    final_color = (uint8_t*) &temp_color;
    temp_color_active = true;
  } else if (new_rgb_color != rgb_color) {
    final_color = (uint8_t*) &new_rgb_color;
    rgb_color = new_rgb_color;
  } else if (temp_color_active) {
    final_color = (uint8_t*) &rgb_color;
  }

#if defined(LED_NEOPIXEL) || defined(LED_RGB_RED_PIN) || defined(LED_APA102_CLK)
  if (final_color != NULL) {
    neopixel_write(final_color);
  }
#else
  (void) final_color;
#endif
}

#ifdef LED_NEOPIXEL

